Microchip-MPLAB-Harmony/usb_apps_device/apps/cdc_com_port_single/firmware/src/packs/ATSAMA5D29_DFP/component/matrix.h
/* -------- MATRIX_SPSELR : (MATRIX Offset: 0x2C0) (R/W 32) Security Peripheral Select 1 Register -------- */
#define MATRIX_SPSELR_NSECP0_Pos              _UINT32_(0)                                          /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP0_Msk              (_UINT32_(0x1) << MATRIX_SPSELR_NSECP0_Pos)          /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP0(value)           (MATRIX_SPSELR_NSECP0_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP0_Pos)) /* Assigment of value for NSECP0 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP1_Pos              _UINT32_(1)                                          /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP1_Msk              (_UINT32_(0x1) << MATRIX_SPSELR_NSECP1_Pos)          /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP1(value)           (MATRIX_SPSELR_NSECP1_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP1_Pos)) /* Assigment of value for NSECP1 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP2_Pos              _UINT32_(2)                                          /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP2_Msk              (_UINT32_(0x1) << MATRIX_SPSELR_NSECP2_Pos)          /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP2(value)           (MATRIX_SPSELR_NSECP2_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP2_Pos)) /* Assigment of value for NSECP2 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP3_Pos              _UINT32_(3)                                          /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP3_Msk              (_UINT32_(0x1) << MATRIX_SPSELR_NSECP3_Pos)          /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP3(value)           (MATRIX_SPSELR_NSECP3_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP3_Pos)) /* Assigment of value for NSECP3 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP4_Pos              _UINT32_(4)                                          /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP4_Msk              (_UINT32_(0x1) << MATRIX_SPSELR_NSECP4_Pos)          /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP4(value)           (MATRIX_SPSELR_NSECP4_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP4_Pos)) /* Assigment of value for NSECP4 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP5_Pos              _UINT32_(5)                                          /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP5_Msk              (_UINT32_(0x1) << MATRIX_SPSELR_NSECP5_Pos)          /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP5(value)           (MATRIX_SPSELR_NSECP5_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP5_Pos)) /* Assigment of value for NSECP5 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP6_Pos              _UINT32_(6)                                          /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP6_Msk              (_UINT32_(0x1) << MATRIX_SPSELR_NSECP6_Pos)          /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP6(value)           (MATRIX_SPSELR_NSECP6_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP6_Pos)) /* Assigment of value for NSECP6 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP7_Pos              _UINT32_(7)                                          /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP7_Msk              (_UINT32_(0x1) << MATRIX_SPSELR_NSECP7_Pos)          /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP7(value)           (MATRIX_SPSELR_NSECP7_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP7_Pos)) /* Assigment of value for NSECP7 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP8_Pos              _UINT32_(8)                                          /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP8_Msk              (_UINT32_(0x1) << MATRIX_SPSELR_NSECP8_Pos)          /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP8(value)           (MATRIX_SPSELR_NSECP8_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP8_Pos)) /* Assigment of value for NSECP8 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP9_Pos              _UINT32_(9)                                          /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP9_Msk              (_UINT32_(0x1) << MATRIX_SPSELR_NSECP9_Pos)          /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP9(value)           (MATRIX_SPSELR_NSECP9_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP9_Pos)) /* Assigment of value for NSECP9 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP10_Pos             _UINT32_(10)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP10_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP10_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP10(value)          (MATRIX_SPSELR_NSECP10_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP10_Pos)) /* Assigment of value for NSECP10 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP11_Pos             _UINT32_(11)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP11_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP11_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP11(value)          (MATRIX_SPSELR_NSECP11_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP11_Pos)) /* Assigment of value for NSECP11 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP12_Pos             _UINT32_(12)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP12_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP12_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP12(value)          (MATRIX_SPSELR_NSECP12_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP12_Pos)) /* Assigment of value for NSECP12 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP13_Pos             _UINT32_(13)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP13_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP13_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP13(value)          (MATRIX_SPSELR_NSECP13_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP13_Pos)) /* Assigment of value for NSECP13 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP14_Pos             _UINT32_(14)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP14_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP14_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP14(value)          (MATRIX_SPSELR_NSECP14_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP14_Pos)) /* Assigment of value for NSECP14 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP15_Pos             _UINT32_(15)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP15_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP15_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP15(value)          (MATRIX_SPSELR_NSECP15_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP15_Pos)) /* Assigment of value for NSECP15 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP16_Pos             _UINT32_(16)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP16_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP16_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP16(value)          (MATRIX_SPSELR_NSECP16_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP16_Pos)) /* Assigment of value for NSECP16 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP17_Pos             _UINT32_(17)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP17_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP17_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP17(value)          (MATRIX_SPSELR_NSECP17_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP17_Pos)) /* Assigment of value for NSECP17 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP18_Pos             _UINT32_(18)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP18_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP18_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP18(value)          (MATRIX_SPSELR_NSECP18_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP18_Pos)) /* Assigment of value for NSECP18 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP19_Pos             _UINT32_(19)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP19_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP19_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP19(value)          (MATRIX_SPSELR_NSECP19_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP19_Pos)) /* Assigment of value for NSECP19 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP20_Pos             _UINT32_(20)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP20_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP20_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP20(value)          (MATRIX_SPSELR_NSECP20_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP20_Pos)) /* Assigment of value for NSECP20 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP21_Pos             _UINT32_(21)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP21_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP21_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP21(value)          (MATRIX_SPSELR_NSECP21_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP21_Pos)) /* Assigment of value for NSECP21 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP22_Pos             _UINT32_(22)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP22_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP22_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP22(value)          (MATRIX_SPSELR_NSECP22_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP22_Pos)) /* Assigment of value for NSECP22 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP23_Pos             _UINT32_(23)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP23_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP23_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP23(value)          (MATRIX_SPSELR_NSECP23_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP23_Pos)) /* Assigment of value for NSECP23 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP24_Pos             _UINT32_(24)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP24_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP24_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP24(value)          (MATRIX_SPSELR_NSECP24_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP24_Pos)) /* Assigment of value for NSECP24 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP25_Pos             _UINT32_(25)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP25_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP25_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP25(value)          (MATRIX_SPSELR_NSECP25_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP25_Pos)) /* Assigment of value for NSECP25 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP26_Pos             _UINT32_(26)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP26_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP26_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP26(value)          (MATRIX_SPSELR_NSECP26_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP26_Pos)) /* Assigment of value for NSECP26 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP27_Pos             _UINT32_(27)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP27_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP27_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP27(value)          (MATRIX_SPSELR_NSECP27_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP27_Pos)) /* Assigment of value for NSECP27 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP28_Pos             _UINT32_(28)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP28_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP28_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP28(value)          (MATRIX_SPSELR_NSECP28_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP28_Pos)) /* Assigment of value for NSECP28 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP29_Pos             _UINT32_(29)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP29_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP29_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP29(value)          (MATRIX_SPSELR_NSECP29_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP29_Pos)) /* Assigment of value for NSECP29 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP30_Pos             _UINT32_(30)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP30_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP30_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP30(value)          (MATRIX_SPSELR_NSECP30_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP30_Pos)) /* Assigment of value for NSECP30 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_NSECP31_Pos             _UINT32_(31)                                         /* (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP31_Msk             (_UINT32_(0x1) << MATRIX_SPSELR_NSECP31_Pos)         /* (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP31(value)          (MATRIX_SPSELR_NSECP31_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP31_Pos)) /* Assigment of value for NSECP31 in the MATRIX_SPSELR register */
#define MATRIX_SPSELR_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (MATRIX_SPSELR) Register Mask  */

#define MATRIX_SPSELR_NSECP_Pos               _UINT32_(0)                                          /* (MATRIX_SPSELR Position) Non-secured Peripheral */
#define MATRIX_SPSELR_NSECP_Msk               (_UINT32_(0xFFFFFFFF) << MATRIX_SPSELR_NSECP_Pos)    /* (MATRIX_SPSELR Mask) NSECP */
#define MATRIX_SPSELR_NSECP(value)            (MATRIX_SPSELR_NSECP_Msk & (_UINT32_(value) << MATRIX_SPSELR_NSECP_Pos)) 

